; domain
(define (domain delivery)
    (:requirements :typing :equality :negative-preconditions :constraints)
    (:types
        cell - object
        locatable - object
        package - locatable
        truck - locatable
    )

    (:predicates
        (at ?x1 - locatable ?x2 - cell)
        (carrying ?x1 - truck ?x2 - package)
        (empty ?x1 - truck)
        (adjacent ?x1 - cell ?x2 - cell)
    )

    (:action pick-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?p ?x) (at ?t ?x) (empty ?t))
     :effect (and
        (not (at ?p ?x))
        (not (empty ?t))
        (carrying ?t ?p))
    )

    (:action drop-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?t ?x) (carrying ?t ?p))
     :effect (and
        (empty ?t)
        (not (carrying ?t ?p))
        (at ?p ?x))
    )

    (:action move
     :parameters (?t - truck ?from - cell ?to - cell)
     :precondition (and (adjacent ?from ?to) (at ?t ?from) (not (= ?from ?to)))
     :effect (and
        (not (at ?t ?from))
        (at ?t ?to))
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem delivery-10x10-1-0)
    (:domain delivery)

    (:objects
        c_0_0 c_0_1 c_0_2 c_0_3 c_0_4 c_0_5 c_0_6 c_0_7 c_0_8 c_0_9 c_1_0 c_1_1 c_1_2 c_1_3 c_1_4 c_1_5 c_1_6 c_1_7 c_1_8 c_1_9 c_2_0 c_2_1 c_2_2 c_2_3 c_2_4 c_2_5 c_2_6 c_2_7 c_2_8 c_2_9 c_3_0 c_3_1 c_3_2 c_3_3 c_3_4 c_3_5 c_3_6 c_3_7 c_3_8 c_3_9 c_4_0 c_4_1 c_4_2 c_4_3 c_4_4 c_4_5 c_4_6 c_4_7 c_4_8 c_4_9 c_5_0 c_5_1 c_5_2 c_5_3 c_5_4 c_5_5 c_5_6 c_5_7 c_5_8 c_5_9 c_6_0 c_6_1 c_6_2 c_6_3 c_6_4 c_6_5 c_6_6 c_6_7 c_6_8 c_6_9 c_7_0 c_7_1 c_7_2 c_7_3 c_7_4 c_7_5 c_7_6 c_7_7 c_7_8 c_7_9 c_8_0 c_8_1 c_8_2 c_8_3 c_8_4 c_8_5 c_8_6 c_8_7 c_8_8 c_8_9 c_9_0 c_9_1 c_9_2 c_9_3 c_9_4 c_9_5 c_9_6 c_9_7 c_9_8 c_9_9 - cell
        p1 - package
        t1 - truck
    )

    (:init
        (adjacent c_5_8 c_5_9)
        (adjacent c_1_5 c_1_6)
        (adjacent c_7_6 c_7_7)
        (adjacent c_3_8 c_3_7)
        (adjacent c_6_7 c_6_8)
        (adjacent c_3_9 c_4_9)
        (adjacent c_2_2 c_3_2)
        (adjacent c_1_4 c_1_5)
        (adjacent c_1_6 c_1_5)
        (adjacent c_5_7 c_5_8)
        (adjacent c_1_4 c_1_3)
        (adjacent c_2_4 c_2_5)
        (adjacent c_3_8 c_3_9)
        (adjacent c_5_3 c_6_3)
        (adjacent c_1_1 c_0_1)
        (adjacent c_3_5 c_3_4)
        (adjacent c_0_2 c_1_2)
        (adjacent c_9_9 c_9_8)
        (adjacent c_9_1 c_9_0)
        (adjacent c_7_1 c_7_0)
        (adjacent c_3_5 c_3_6)
        (adjacent c_5_4 c_5_3)
        (adjacent c_8_6 c_8_7)
        (adjacent c_3_1 c_4_1)
        (adjacent c_6_1 c_7_1)
        (adjacent c_3_3 c_3_2)
        (adjacent c_2_4 c_2_3)
        (adjacent c_6_9 c_6_8)
        (adjacent c_1_2 c_1_3)
        (adjacent c_5_0 c_5_1)
        (adjacent c_6_5 c_7_5)
        (adjacent c_5_4 c_6_4)
        (adjacent c_4_6 c_4_5)
        (adjacent c_6_7 c_5_7)
        (adjacent c_7_7 c_8_7)
        (adjacent c_2_0 c_3_0)
        (adjacent c_6_0 c_7_0)
        (adjacent c_6_6 c_5_6)
        (adjacent c_9_7 c_8_7)
        (adjacent c_8_5 c_9_5)
        (adjacent c_8_6 c_9_6)
        (adjacent c_2_5 c_1_5)
        (adjacent c_1_3 c_1_2)
        (adjacent c_5_0 c_6_0)
        (adjacent c_8_8 c_8_9)
        (adjacent c_9_2 c_9_1)
        (adjacent c_2_3 c_2_4)
        (adjacent c_7_5 c_7_6)
        (adjacent c_3_9 c_2_9)
        (adjacent c_8_1 c_7_1)
        (adjacent c_4_7 c_3_7)
        (adjacent c_3_4 c_3_5)
        (adjacent c_6_8 c_7_8)
        (adjacent c_8_9 c_8_8)
        (adjacent c_7_5 c_6_5)
        (adjacent c_8_2 c_9_2)
        (adjacent c_6_7 c_6_6)
        (adjacent c_9_4 c_8_4)
        (adjacent c_3_8 c_4_8)
        (adjacent c_4_4 c_4_5)
        (adjacent c_0_3 c_1_3)
        (adjacent c_7_4 c_7_3)
        (adjacent c_5_2 c_6_2)
        (adjacent c_9_6 c_9_7)
        (adjacent c_6_5 c_6_6)
        (adjacent c_0_4 c_0_5)
        (adjacent c_9_3 c_9_4)
        (adjacent c_1_2 c_1_1)
        (adjacent c_0_2 c_0_1)
        (adjacent c_5_4 c_5_5)
        (adjacent c_0_1 c_1_1)
        (adjacent c_8_7 c_9_7)
        (adjacent c_5_8 c_5_7)
        (adjacent c_9_8 c_9_9)
        (adjacent c_1_2 c_0_2)
        (adjacent c_0_1 c_0_2)
        (adjacent c_8_4 c_9_4)
        (adjacent c_1_4 c_0_4)
        (adjacent c_1_6 c_1_7)
        (adjacent c_6_8 c_6_9)
        (adjacent c_4_6 c_3_6)
        (adjacent c_2_2 c_2_3)
        (adjacent c_1_9 c_2_9)
        (adjacent c_0_0 c_1_0)
        (adjacent c_8_8 c_9_8)
        (adjacent c_1_5 c_2_5)
        (adjacent c_2_7 c_1_7)
        (adjacent c_6_3 c_5_3)
        (adjacent c_3_5 c_4_5)
        (adjacent c_6_4 c_7_4)
        (adjacent c_0_5 c_1_5)
        (adjacent c_4_9 c_5_9)
        (adjacent c_2_7 c_2_8)
        (adjacent c_1_7 c_1_8)
        (adjacent c_4_4 c_3_4)
        (adjacent c_7_9 c_8_9)
        (adjacent c_6_3 c_6_4)
        (adjacent c_9_6 c_8_6)
        (adjacent c_7_2 c_7_3)
        (adjacent c_7_8 c_7_7)
        (adjacent c_3_3 c_2_3)
        (adjacent c_4_7 c_4_8)
        (adjacent c_1_4 c_2_4)
        (adjacent c_5_7 c_4_7)
        (adjacent c_6_9 c_5_9)
        (adjacent c_0_2 c_0_3)
        (adjacent c_3_7 c_3_6)
        (adjacent c_7_0 c_7_1)
        (adjacent c_8_9 c_7_9)
        (adjacent c_3_1 c_2_1)
        (adjacent c_3_6 c_3_5)
        (adjacent c_5_9 c_5_8)
        (adjacent c_5_2 c_4_2)
        (adjacent c_5_3 c_5_4)
        (adjacent c_8_3 c_8_4)
        (adjacent c_2_1 c_2_0)
        (adjacent c_4_5 c_4_6)
        (adjacent c_8_3 c_9_3)
        (adjacent c_8_7 c_8_8)
        (adjacent c_2_6 c_3_6)
        (adjacent c_8_1 c_8_0)
        (adjacent c_0_8 c_0_7)
        (adjacent c_4_1 c_4_2)
        (adjacent c_0_9 c_1_9)
        (adjacent c_4_0 c_3_0)
        (adjacent c_0_8 c_0_9)
        (adjacent c_8_4 c_8_5)
        (adjacent c_5_6 c_5_7)
        (adjacent c_8_0 c_8_1)
        (adjacent c_3_1 c_3_2)
        (adjacent c_3_4 c_2_4)
        (adjacent c_5_2 c_5_1)
        (adjacent c_4_1 c_3_1)
        (adjacent c_1_3 c_0_3)
        (adjacent c_6_4 c_6_3)
        (adjacent c_7_8 c_6_8)
        (adjacent c_3_6 c_3_7)
        (adjacent c_8_2 c_7_2)
        (adjacent c_2_2 c_1_2)
        (adjacent c_6_8 c_6_7)
        (adjacent c_6_9 c_7_9)
        (adjacent c_1_8 c_0_8)
        (adjacent c_6_6 c_7_6)
        (adjacent c_4_1 c_5_1)
        (adjacent c_1_9 c_1_8)
        (adjacent c_5_9 c_4_9)
        (adjacent c_8_8 c_7_8)
        (adjacent c_5_1 c_6_1)
        (adjacent c_5_6 c_4_6)
        (adjacent c_3_3 c_3_4)
        (adjacent c_5_6 c_6_6)
        (adjacent c_5_0 c_4_0)
        (adjacent c_4_6 c_5_6)
        (adjacent c_1_3 c_1_4)
        (adjacent c_8_1 c_8_2)
        (adjacent c_8_5 c_7_5)
        (adjacent c_6_5 c_5_5)
        (adjacent c_7_5 c_7_4)
        (adjacent c_2_8 c_3_8)
        (adjacent c_1_1 c_1_0)
        (adjacent c_5_2 c_5_3)
        (adjacent c_0_5 c_0_4)
        (adjacent c_8_2 c_8_3)
        (adjacent c_8_6 c_7_6)
        (adjacent c_3_1 c_3_0)
        (adjacent c_9_1 c_8_1)
        (adjacent c_5_1 c_5_0)
        (adjacent c_1_0 c_1_1)
        (adjacent c_0_6 c_0_5)
        (adjacent c_8_7 c_7_7)
        (adjacent c_5_5 c_6_5)
        (adjacent c_7_6 c_7_5)
        (adjacent c_9_7 c_9_6)
        (adjacent c_1_1 c_2_1)
        (adjacent c_5_8 c_4_8)
        (adjacent c_2_7 c_3_7)
        (adjacent c_2_5 c_3_5)
        (adjacent c_0_7 c_1_7)
        (adjacent c_9_5 c_9_4)
        (adjacent c_3_0 c_3_1)
        (adjacent c_7_7 c_7_6)
        (adjacent c_4_5 c_4_4)
        (adjacent c_9_3 c_8_3)
        (adjacent c_2_9 c_2_8)
        (adjacent c_9_4 c_9_5)
        (adjacent c_7_0 c_8_0)
        (adjacent c_1_7 c_0_7)
        (adjacent c_0_6 c_0_7)
        (adjacent c_7_0 c_6_0)
        (adjacent c_9_3 c_9_2)
        (adjacent c_2_4 c_3_4)
        (adjacent c_7_1 c_6_1)
        (adjacent c_7_4 c_7_5)
        (adjacent c_7_1 c_8_1)
        (adjacent c_2_9 c_1_9)
        (adjacent c_8_4 c_8_3)
        (adjacent c_3_6 c_2_6)
        (adjacent c_2_4 c_1_4)
        (adjacent c_3_2 c_2_2)
        (adjacent c_7_9 c_7_8)
        (adjacent c_2_3 c_1_3)
        (adjacent c_3_5 c_2_5)
        (adjacent c_7_5 c_8_5)
        (adjacent c_0_6 c_1_6)
        (adjacent c_5_5 c_4_5)
        (adjacent c_5_5 c_5_6)
        (adjacent c_7_6 c_6_6)
        (adjacent c_8_4 c_7_4)
        (adjacent c_9_7 c_9_8)
        (adjacent c_6_1 c_5_1)
        (adjacent c_4_2 c_5_2)
        (adjacent c_6_0 c_6_1)
        (adjacent c_9_8 c_9_7)
        (adjacent c_7_2 c_6_2)
        (adjacent c_4_2 c_4_3)
        (adjacent c_7_2 c_8_2)
        (adjacent c_0_3 c_0_2)
        (adjacent c_0_1 c_0_0)
        (adjacent c_6_1 c_6_0)
        (adjacent c_2_0 c_1_0)
        (adjacent c_6_0 c_5_0)
        (adjacent c_8_7 c_8_6)
        (adjacent c_1_6 c_2_6)
        (adjacent c_1_6 c_0_6)
        (adjacent c_8_9 c_9_9)
        (adjacent c_7_9 c_6_9)
        (adjacent c_7_3 c_7_2)
        (adjacent c_9_5 c_8_5)
        (adjacent c_2_7 c_2_6)
        (adjacent c_4_5 c_3_5)
        (adjacent c_8_0 c_9_0)
        (adjacent c_6_4 c_5_4)
        (adjacent c_0_4 c_0_3)
        (adjacent c_6_5 c_6_4)
        (adjacent c_0_3 c_0_4)
        (adjacent c_6_3 c_7_3)
        (adjacent c_4_3 c_4_4)
        (adjacent c_5_6 c_5_5)
        (adjacent c_5_7 c_6_7)
        (adjacent c_2_1 c_2_2)
        (adjacent c_6_1 c_6_2)
        (adjacent c_2_8 c_2_7)
        (adjacent c_4_7 c_5_7)
        (adjacent c_0_4 c_1_4)
        (adjacent c_4_8 c_3_8)
        (adjacent c_7_3 c_8_3)
        (adjacent c_2_5 c_2_4)
        (adjacent c_3_2 c_4_2)
        (adjacent c_9_0 c_8_0)
        (adjacent c_2_8 c_2_9)
        (adjacent c_5_1 c_4_1)
        (adjacent c_4_1 c_4_0)
        (adjacent c_4_8 c_4_7)
        (adjacent c_2_5 c_2_6)
        (adjacent c_4_4 c_4_3)
        (adjacent c_4_0 c_5_0)
        (adjacent c_6_6 c_6_5)
        (adjacent c_6_2 c_7_2)
        (adjacent c_6_8 c_5_8)
        (adjacent c_9_8 c_8_8)
        (adjacent c_2_9 c_3_9)
        (adjacent c_7_7 c_7_8)
        (adjacent c_4_9 c_4_8)
        (adjacent c_3_2 c_3_1)
        (adjacent c_7_3 c_7_4)
        (adjacent c_4_7 c_4_6)
        (adjacent c_0_9 c_0_8)
        (adjacent c_2_3 c_3_3)
        (adjacent c_5_1 c_5_2)
        (adjacent c_7_1 c_7_2)
        (adjacent c_9_2 c_8_2)
        (adjacent c_4_8 c_5_8)
        (adjacent c_1_5 c_1_4)
        (adjacent c_2_3 c_2_2)
        (adjacent c_3_7 c_2_7)
        (adjacent c_1_7 c_2_7)
        (adjacent c_8_5 c_8_4)
        (adjacent c_4_4 c_5_4)
        (adjacent c_9_1 c_9_2)
        (adjacent c_4_6 c_4_7)
        (adjacent c_7_4 c_6_4)
        (adjacent c_5_4 c_4_4)
        (adjacent c_0_8 c_1_8)
        (adjacent c_8_8 c_8_7)
        (adjacent c_5_8 c_6_8)
        (adjacent c_3_8 c_2_8)
        (adjacent c_2_6 c_2_7)
        (adjacent c_8_5 c_8_6)
        (adjacent c_8_1 c_9_1)
        (adjacent c_6_2 c_6_1)
        (adjacent c_5_9 c_6_9)
        (adjacent c_4_2 c_3_2)
        (adjacent c_2_6 c_2_5)
        (adjacent c_9_2 c_9_3)
        (adjacent c_7_8 c_8_8)
        (adjacent c_3_7 c_3_8)
        (adjacent c_4_3 c_4_2)
        (adjacent c_3_0 c_4_0)
        (adjacent c_8_2 c_8_1)
        (adjacent c_0_0 c_0_1)
        (adjacent c_7_6 c_8_6)
        (adjacent c_6_2 c_5_2)
        (adjacent c_4_2 c_4_1)
        (adjacent c_3_2 c_3_3)
        (adjacent c_3_7 c_4_7)
        (adjacent c_5_5 c_5_4)
        (adjacent c_9_4 c_9_3)
        (adjacent c_4_8 c_4_9)
        (adjacent c_7_4 c_8_4)
        (adjacent c_3_3 c_4_3)
        (adjacent c_0_5 c_0_6)
        (adjacent c_6_6 c_6_7)
        (adjacent c_7_3 c_6_3)
        (adjacent c_9_0 c_9_1)
        (adjacent c_1_7 c_1_6)
        (adjacent c_8_6 c_8_5)
        (adjacent c_1_0 c_0_0)
        (adjacent c_3_9 c_3_8)
        (adjacent c_2_8 c_1_8)
        (adjacent c_2_1 c_3_1)
        (adjacent c_2_1 c_1_1)
        (adjacent c_9_5 c_9_6)
        (adjacent c_0_7 c_0_6)
        (adjacent c_2_6 c_1_6)
        (adjacent c_1_0 c_2_0)
        (adjacent c_1_1 c_1_2)
        (adjacent c_8_0 c_7_0)
        (adjacent c_9_6 c_9_5)
        (adjacent c_4_5 c_5_5)
        (adjacent c_4_9 c_3_9)
        (adjacent c_1_5 c_0_5)
        (adjacent c_5_3 c_5_2)
        (adjacent c_6_7 c_7_7)
        (adjacent c_1_8 c_1_7)
        (adjacent c_8_3 c_8_2)
        (adjacent c_5_7 c_5_6)
        (adjacent c_3_0 c_2_0)
        (adjacent c_9_9 c_8_9)
        (adjacent c_0_7 c_0_8)
        (adjacent c_5_3 c_4_3)
        (adjacent c_8_3 c_7_3)
        (adjacent c_6_2 c_6_3)
        (adjacent c_1_8 c_2_8)
        (adjacent c_4_3 c_5_3)
        (adjacent c_2_2 c_2_1)
        (adjacent c_2_0 c_2_1)
        (adjacent c_6_4 c_6_5)
        (adjacent c_7_7 c_6_7)
        (adjacent c_1_3 c_2_3)
        (adjacent c_1_9 c_0_9)
        (adjacent c_4_3 c_3_3)
        (adjacent c_4_0 c_4_1)
        (adjacent c_6_3 c_6_2)
        (adjacent c_3_4 c_3_3)
        (adjacent c_3_6 c_4_6)
        (adjacent c_7_2 c_7_1)
        (adjacent c_1_8 c_1_9)
        (adjacent c_1_2 c_2_2)
        (adjacent c_7_8 c_7_9)
        (adjacent c_3_4 c_4_4)
        (at p1 c_1_5)
        (at t1 c_5_3)
        (empty t1)
    )

    (:goal
        (at p1 c_7_4)
    )

    
    
    
)

; plan
1. (move t1 c_5_3 c_5_4)
   deleted: (at t1 c_5_3)
   added: (at t1 c_5_4)
   goals met: 0 of 1
2. (move t1 c_5_4 c_4_4)
   deleted: (at t1 c_5_4)
   added: (at t1 c_4_4)
   goals met: 0 of 1
3. (move t1 c_4_4 c_3_4)
   deleted: (at t1 c_4_4)
   added: (at t1 c_3_4)
   goals met: 0 of 1
4. (move t1 c_3_4 c_2_4)
   deleted: (at t1 c_3_4)
   added: (at t1 c_2_4)
   goals met: 0 of 1
5. (move t1 c_2_4 c_1_4)
   deleted: (at t1 c_2_4)
   added: (at t1 c_1_4)
   goals met: 0 of 1
6. (move t1 c_1_4 c_1_5)
   deleted: (at t1 c_1_4)
   added: (at t1 c_1_5)
   goals met: 0 of 1
7. (pick-package t1 p1 c_1_5)
   deleted: (at p1 c_1_5) (empty t1)
   added: (carrying t1 p1)
   goals met: 0 of 1
8. (move t1 c_1_5 c_1_4)
   deleted: (at t1 c_1_5)
   added: (at t1 c_1_4)
   goals met: 0 of 1
9. (move t1 c_1_4 c_2_4)
   deleted: (at t1 c_1_4)
   added: (at t1 c_2_4)
   goals met: 0 of 1
10. (move t1 c_2_4 c_3_4)
   deleted: (at t1 c_2_4)
   added: (at t1 c_3_4)
   goals met: 0 of 1
11. (move t1 c_3_4 c_4_4)
   deleted: (at t1 c_3_4)
   added: (at t1 c_4_4)
   goals met: 0 of 1
12. (move t1 c_4_4 c_5_4)
   deleted: (at t1 c_4_4)
   added: (at t1 c_5_4)
   goals met: 0 of 1
13. (move t1 c_5_4 c_6_4)
   deleted: (at t1 c_5_4)
   added: (at t1 c_6_4)
   goals met: 0 of 1
14. (move t1 c_6_4 c_7_4)
   deleted: (at t1 c_6_4)
   added: (at t1 c_7_4)
   goals met: 0 of 1
15. (drop-package t1 p1 c_7_4)
   deleted: (carrying t1 p1)
   added: (empty t1) (at p1 c_7_4)
   goals met: 1 of 1
